       IDENTIFICATION DIVISION.
       PROGRAM-ID. TEST.
       PROCEDURE DIVISION.
           PERFORM PASS GO TO PARA-1.
           STOP RUN.
       PASS.
           DISPLAY "PASS".
       PARA-1.
           DISPLAY "DONE".
