000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. NIST-TEST.
000300 DATA DIVISION.
000400 WORKING-STORAGE SECTION.
000500 01 TEST-VAR PIC X(10) VALUE "HELLO".
000600 PROCEDURE DIVISION.
000700     DISPLAY TEST-VAR.
000800     STOP RUN.
